AxiSymmetric/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5700;
        startFace       11081;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5700;
        startFace       16781;
    }
    tankWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       22481;
    }
    inlet
    {
        type            patch;
        nFaces          19;
        startFace       22781;
    }
    outlet
    {
        type            patch;
        nFaces          19;
        startFace       22800;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       22819;
    }
)

// ************************************************************************* //
